let resources = {
    upgrades: {
        energy: 'Энергия',
        profit: 'Прибыль',
        per_hour: 'в час',
        default: 'По умолчанию',
        personal: 'Персонал',
        casino: 'Казино',
        interier: 'Интерьер',
        business: 'Бизнес',
        friends: 'Друзья',
        sport: 'Спорт',
        banner: 'Улучши свое казино и заработай\n еще больше монет',
    },

    menubar: {
        casino: 'Казино',
        shop: 'Магазин',
        earn: 'Кликер',
        // рулетка
        roulette: 'Рулетка',
        friends: 'Друзья',
        tasks: 'Задания',
        game: 'Игры',
        ban: 'Бан',
        new_bot: 'Новый бот',
        account: 'Аккаунт',

    },
    roll: {
        coin: 'Монеты',
        spin: 'Спин',
        car: 'Суперкар',
        mackbook: 'Mackbook pro',
        iphone: 'Iphone 15 pro',

    },

    account: {
        stats: 'Статистика',
        settings: 'Настройки',
        crypto: 'Криптовалюта',
        walletAddress: 'Адрес кошелька',
        language: 'Язык',
        gender: 'Гендер',
        music: 'Музыка',
        vibration: 'Вибрация',
        totalClick: 'Всего кликов',
        totalSpin: 'Всего спинов',
        earnStars: 'Заработать звезды',
        level: 'Уровень',
    },

    base: {
        // воспоминания
        memories: 'Воспоминания',
        check: 'Проверить',
        buyAutoClicker: 'Купить автокликер',
        claim: 'Забрать',
    },

    layout: {
        rating: 'Рейтинг',
    },


    memories: {
        click: 'Клики',
        clickDesc: 'Количество кликов',
        registerData: 'Дата регистрации',
        friends: 'Друзья',
        friendsDesc: 'Количество друзей',
        goodPosition: 'Хорошая позиция',
        ratingDesc: 'Рейтинг',
        earned: 'Заработанно',
        earnedDesc: 'Всего заработанно монет',
        spin: 'Спины',
        spinDesc: 'Бонусные спины',
        ttm: 'TTM',
        ttmDesc: 'Бонусные USDT',
        ttmExtra: 'Данные $ вы сможете использовать в проекте TTM',
        bonusSpin: 'Колличество бонусных спинов за вашу активность',
    },

    friends: {
        addFriend: 'Добавить в друзья',
        inviteFrens: 'Приглашай друзей',
        earnPoints: 'Зарабатывай очки',
        shareYourLink: 'Поделись ссылкой',
        getInstantBonus: 'Получить бонус сразу после подключения друга',
        yourFriendStartsPlaying: 'Твой друг начинает играть',
        startsMakingMoney: 'А ты начинаешь зарабатывать вместе с ним',
        every8Hours: 'Каждые 8 часов ты получаешь 5% от прибыли всех твоих друзей',
        fivePercentOfYourFrensProfit: '5% от прибыли твоих друзей',
        howItWorks: 'Как это работает',
        copyLink: 'Скопировать ссылку',
        friends: 'Друзей',
        earn5Percent: 'Зарабатывай 5% от прибыли всех твоих друзей каждые 8 часов',
        inviteFriends: 'Приглашай друзей и получай более ценные призы',
    },

    tasks: {
        dailyTasks: 'Ежедневные задания',
        permanentTasks: 'Постоянные задания',
        dailyReward: 'Ежедневная награда',
        dailyRewardDesc: 'Заходи в игру ежедневно и получай ценные бонусы',
        claim: 'Забрать',
        banner: 'Выполняй ежедневные задания и зарабатывай больше монет',
    },


    games: {
        // выигрыш
        win: 'Выигрыш',
        // колесо фортуны
        fortuneWheel: 'Колесо фортуны',
        //ставка
        bet: 'Ставка',
        apply: 'Применить',
        minBet: 'Минимальная ставка',
        maxBet: 'Максимальная ставка',
        notEnoughCoins: 'Недостаточно средств',
        unknownError: 'Неизвестная ошибка',
        buyChips: 'Купить фишки',
        moreSpins: 'Больше спинов',
        spin: 'Спин',
        bonusGame: 'Bonus game',
        giftPage: 'Страница бонусов',
        bonus: 'Бонус',
        bonusGame: 'Бонусная игра',
        bonusGameDesc: 'Получай бонусы за выполнение заданий',
        getPrize: 'Получить приз',
        congratulations: 'Поздравляем! Вы выиграли приз!',
        unknownError: 'Произошла ошибка при получении приза. Попробуйте еще раз.',
        increaseChance: 'Увеличь шанс на победу',
        inviteFriends: 'Зови друзей и получи более ценный приз',
        getAccess: 'Получить доступ',
        coin: 'Монеты',
        spin: 'Спин',
        letter: 'Буква',
        undefined: '~',


        'about-casino': {
            table: 'Таблица выплат',
            replace: 'Заменяет символы:',
            replaceMore: 'Wild может заменить любой символ, кроме символа Mellstory, чтобы сформировать выигрышную комбинацию.',
            wild: 'Wild',

            rules: 'Правила',
            rulesT1: 'Royal clicker slots - это слот с 5 барабанами и 3 рядами и 15 линиями выплат.',
            rulesT2: 'Все призы - это комбинации одинаковых символов.',
            rulesT3: 'Символы, кроме символа mellstroy, должны находиться на активированных линиях выплат и на соседних барабанах, начиная с крайнего левого барабана.',
            rulesT4: 'Символы Mellstroy засчитываются в любом месте на барабанах.',
            rulesT5: 'За число символов Mellstroy и комбинаций на каждой активированной линии выплачивается только самый высокий выйигрыш.',
            rulesT6: 'Выигрыши за символы Mellstroy и комбинации на разных линиях складываются.',
            rulesT7: 'Все призы в таблице выплат указаны для выбранных в настоящий момент ставки и числа линий выйплат.',
            rulesT8: 'Все призы в в табилце выплат отображаются в деньгах или в кредитах в зависимости от выбранного в настоящий момент режима игры.',

            lines: 'Линии выплат',
            chips: 'Фишки',
            chipsT1: '2 и более символов Mellstory на всем барабане дает пользвателю от 1 до 15 фишек',
            
            attention: 'Внимание!',
            attentionT1: 'Все незавершенные игры, неполученные выйгрыши, неиспользованные накопленные бонусы сохраняются в течение 7 дней, после чего удаляются. Сохранение результаты мобыть быть удалены досрочно, в случае планогового обслуживания системы и обслюживания сервера. Перед выходом из игры убедитесь что забрли все выигрыши и призы',
            attentionT2: 'В случае каких-либо расхождений или несоответствий между английский версией и ее переводами на другие языки, английская версия имеет преимущество.',
       

            info: 'Информация по юрисдикции',
            infoT1: 'КОЭФФИЦИЕНТЫ ВОЗВРАТА ИГРОКУ (RTP): 96.03 %',
            infoT2: 'МИНИМАЛЬНАЯ ОБЩАЯ СТАВКА: 1000 (Монет)',
            infoT3: 'МАКСИМАЛЬНАЯ ОБЩАЯ СТАВКА: 1 000 000 (Монет)',
            
        }


    }

}


export default resources;